In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
data = pd.read_csv("tested.csv")

In [ ]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
data['Survived'].value_counts()

0    266
1    152
Name: Survived, dtype: int64

In [ ]:
print("Total Number of Passengers in training data... ",len(data))
print("Number of passengers who survived ",len(data[data['Survived'] == 1 ]))
print("Number of passengers who didn't survived ",len(data[data['Survived'] == 0]))

Total Number of Passengers in training data...  418
Number of passengers who survived  152
Number of passengers who didn't survived  266

In [ ]:
data['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [ ]:
print("% of men survived: ",100*np.mean(data['Survived'] [data ['Sex'] == 'male'])) 
print("% of women survived: ",100*np.mean(data['Survived'] [data['Sex'] == 'female']))

% of men survived:  0.0
% of women survived:  100.0

In [ ]:
np.mean(data['Survived'] [data ['Sex'] == 'male'])

0.0

In [ ]:
data['Pclass'].value_counts()

3    218
1    107
2     93
Name: Pclass, dtype: int64

In [ ]:
print("% of passenger who survived in 1st class: ", 100*np.mean(data['Survived'] [data['Pclass'] == 1]))
print("% of passenger who survived in 2nd class: ", 100*np.mean(data['Survived'] [data['Pclass'] == 2]))
print("% of passenger who survived in 3rd class: ", 100*np.mean(data['Survived'] [data['Pclass'] == 3]))

% of passenger who survived in 1st class:  46.728971962616825
% of passenger who survived in 2nd class:  32.25806451612903
% of passenger who survived in 3rd class:  33.02752293577982

In [ ]:
data['Age'].value_counts()

21.0    17
24.0    17
22.0    16
30.0    15
18.0    13
        ..
76.0     1
28.5     1
22.5     1
62.0     1
38.5     1
Name: Age, Length: 79, dtype: int64

In [ ]:
df2=data.copy() 

df2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
int(data['Age'].mean())

30

In [ ]:
df2['Age'] = df2['Age'].fillna(np.mean(df2['Age'])) 

df2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
df2.Embarked.value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [ ]:
df2.Fare.value_counts()

7.7500     21
26.0000    19
13.0000    17
8.0500     17
7.8958     11
           ..
7.8208      1
8.5167      1
78.8500     1
52.0000     1
22.3583     1
Name: Fare, Length: 169, dtype: int64

In [ ]:
fare = df2['Fare'].dropna()

In [ ]:
df2[df2['Fare'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
152,1044,0,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S

In [ ]:
df2['Cabin'].value_counts()

B57 B59 B63 B66    3
B45                2
C89                2
C55 C57            2
A34                2
                  ..
E52                1
D30                1
E31                1
C62 C64            1
C105               1
Name: Cabin, Length: 76, dtype: int64

In [ ]:
df2['Cabin'].mode()

0    B57 B59 B63 B66
Name: Cabin, dtype: object

In [ ]:
df2['Cabin'].fillna(df2['Cabin'].mode()[0], inplace = True)

In [ ]:
df2.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           1
Cabin          0
Embarked       0
dtype: int64